MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.h
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_smartcard.h
  * @brief   Header file of SMARTCARD HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_HAL_SMARTCARD_H
#define STM32C5XX_HAL_SMARTCARD_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_ll_usart.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined(USART1) || defined(USART2) || defined(USART3) || defined(UART4) || defined(UART5) || defined(USART6) \
 || defined(UART7)
/** @defgroup SMARTCARD SMARTCARD
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup SMARTCARD_Exported_Types HAL SMARTCARD Types
  * @{
  */

/**
  * @brief HAL SMARTCARD Instance Definition.
  */
typedef enum
{
  /*! Instance USART1 */
  HAL_SMARTCARD1 = USART1_BASE,
  /*! Instance USART2 */
  HAL_SMARTCARD2 = USART2_BASE,
#if defined(USART3)
  /*! Instance USART3 */
  HAL_SMARTCARD3 = USART3_BASE,
#endif /* USART3 */
#if defined(USART6)
  /*! Instance USART6 */
  HAL_SMARTCARD6 = USART6_BASE,
#endif /* USART6 */
} hal_smartcard_t;

/**
  * @brief HAL SMARTCARD State enum Definition.
  */
typedef enum
{
  /*! Peripheral is not initialized */
  HAL_SMARTCARD_STATE_RESET            = 0U,
  /*! Peripheral is initialized but not configured */
  HAL_SMARTCARD_STATE_INIT             = (1UL << 31U),
  /*! Peripheral is initialized and a config is set */
  HAL_SMARTCARD_STATE_IDLE             = (1UL << 30U),
  /*! Peripheral is receiving */
  HAL_SMARTCARD_STATE_RX_ACTIVE        = (1UL << 29U),
  /*! Peripheral is transmitting */
  HAL_SMARTCARD_STATE_TX_ACTIVE        = (1UL << 28U),
  /*! Peripheral is aborting the current process */
  HAL_SMARTCARD_STATE_ABORT            = (1UL << 27U)
} hal_smartcard_state_t;

/**
  * @brief HAL SMARTCARD Stop bits enum definition.
  */
typedef enum
{
  /*!< 0.5 stop bit */
  HAL_SMARTCARD_STOP_BIT_0_5           =        LL_USART_STOP_BIT_0_5,
  /*!< 1.5 stop bits */
  HAL_SMARTCARD_STOP_BIT_1_5           =        LL_USART_STOP_BIT_1_5
} hal_smartcard_stop_bits_t;

/**
  * @brief HAL SMARTCARD inversion status definition.
  */
typedef enum
{
  /*!< Not Inverted */
  HAL_SMARTCARD_IO_INVERT_DISABLED     =        0U,
  /*!< Inverted */
  HAL_SMARTCARD_IO_INVERT_ENABLED      =        1U
} hal_smartcard_io_invert_status_t;

/**
  * @brief HAL SMARTCARD data status definition.
  */
typedef enum
{
  /*! SMARTCARD Data Binary Inversion is disabled */
  HAL_SMARTCARD_DATA_INVERT_DISABLED   = 0U,
  /*! SMARTCARD Data Binary Inversion is enabled */
  HAL_SMARTCARD_DATA_INVERT_ENABLED    = 1U,
} hal_smartcard_data_invert_status_t;

/**
  * @brief HAL SMARTCARD Swap Tx/Rx Status Definition.
  */
typedef enum
{
  /*! SMARTCARD Tx Rx Swap Pins is disabled */
  HAL_SMARTCARD_TX_RX_SWAP_DISABLED    = 0U,
  /*! SMARTCARD Tx Rx Swap Pins is enabled */
  HAL_SMARTCARD_TX_RX_SWAP_ENABLED     = 1U,
} hal_smartcard_tx_rx_swap_status_t;

/**
  * @brief HAL SMARTCARD Bit order enum definition.
  */
typedef enum
{
  /*!< LSB First */
  HAL_SMARTCARD_BIT_ORDER_LSB_FIRST    =        LL_USART_BITORDER_LSB_FIRST,
  /*!< MSB First */
  HAL_SMARTCARD_BIT_ORDER_MSB_FIRST    =        LL_USART_BITORDER_MSB_FIRST
} hal_smartcard_bit_order_t ;

/**
  * @brief HAL SMARTCARD Parity enum definition.
  */
typedef enum
{
  /*!< Parity control enabled and Even Parity is selected */
  HAL_SMARTCARD_PARITY_ODD     =      LL_USART_PARITY_ODD,
  /*!< Parity control enabled and Odd Parity is selected */
  HAL_SMARTCARD_PARITY_EVEN    =      LL_USART_PARITY_EVEN
} hal_smartcard_parity_t;

/**
  * @brief HAL SMARTCARD Overrun enum definition.
  */
typedef enum
{
  /*!< Overrun Rx errors detection enabled */
  HAL_SMARTCARD_OVERRUN_DETECT_ENABLED         =        1U,
  /*!< Overrun Rx errors detection disabled */
  HAL_SMARTCARD_OVERRUN_DETECT_DISABLED        =        0U
} hal_smartcard_rx_overrun_detection_status_t;

/**
  * @brief HAL SMARTCARD DMA stop on Rx error enum definition.
  */
typedef enum
{
  /*!< No impact on DMA */
  HAL_SMARTCARD_DMA_STOP_NONE          =        0U,
  /*!< DMA disable on rx error */
  HAL_SMARTCARD_DMA_STOP_ON_RX_ERROR   =        1U
} hal_smartcard_dma_stop_status_t;

/**
  * @brief HAL SMARTCARD NACK management enum definition.
  */
typedef enum
{
  /*!< NACK disabled */
  HAL_SMARTCARD_NACK_DISABLE          =        0U,
  /*!< NACK enabled */
  HAL_SMARTCARD_NACK_ENABLE           =        1U
} hal_smartcard_nack_state_t;

/**
  * @brief HAL SMARTCARD Smartcard prescaler enum definition.
  */
typedef enum
{
  /*!< USART input CLK \1 */
  HAL_SMARTCARD_CLOCK_PRESC_DIV1         = LL_USART_PRESCALER_DIV1,
  /*!< USART input CLK \2 */
  HAL_SMARTCARD_CLOCK_PRESC_DIV2         = LL_USART_PRESCALER_DIV2,
  /*!< USART input CLK \4 */
  HAL_SMARTCARD_CLOCK_PRESC_DIV4         = LL_USART_PRESCALER_DIV4,
  /*!< USART input CLK \6 */
  HAL_SMARTCARD_CLOCK_PRESC_DIV6         = LL_USART_PRESCALER_DIV6,
  /*!< USART input CLK \8 */
  HAL_SMARTCARD_CLOCK_PRESC_DIV8         = LL_USART_PRESCALER_DIV8,
  /*!< USART input CLK \10 */
  HAL_SMARTCARD_CLOCK_PRESC_DIV10        = LL_USART_PRESCALER_DIV10,
  /*!< USART input CLK \12 */
  HAL_SMARTCARD_CLOCK_PRESC_DIV12        = LL_USART_PRESCALER_DIV12,
  /*!< USART input CLK \16 */
  HAL_SMARTCARD_CLOCK_PRESC_DIV16        = LL_USART_PRESCALER_DIV16,
  /*!< USART input CLK \32 */
  HAL_SMARTCARD_CLOCK_PRESC_DIV32        = LL_USART_PRESCALER_DIV32,
  /*!< USART input CLK \64 */
  HAL_SMARTCARD_CLOCK_PRESC_DIV64        = LL_USART_PRESCALER_DIV64,
  /*!< USART input CLK \128 */
  HAL_SMARTCARD_CLOCK_PRESC_DIV128       = LL_USART_PRESCALER_DIV128,
  /*!< USART input CLK \256 */
  HAL_SMARTCARD_CLOCK_PRESC_DIV256       = LL_USART_PRESCALER_DIV256
} hal_smartcard_prescaler_t;

/**
  * @brief HAL SMARTCARD Smartcard SCLK prescaler enum definition.
  */
typedef enum
{
  /*!< SMARTCARD Output CLK /2 */
  HAL_SMARTCARD_SCLK_PRESC_DIV2        = LL_USART_SMARTCARD_PRESCALER_DIV2,
  /*!< SMARTCARD Output CLK /4 */
  HAL_SMARTCARD_SCLK_PRESC_DIV4        = LL_USART_SMARTCARD_PRESCALER_DIV4,
  /*!< SMARTCARD Output CLK /6 */
  HAL_SMARTCARD_SCLK_PRESC_DIV6        = LL_USART_SMARTCARD_PRESCALER_DIV6,
  /*!< SMARTCARD Output CLK /8 */
  HAL_SMARTCARD_SCLK_PRESC_DIV8        = LL_USART_SMARTCARD_PRESCALER_DIV8,
  /*!< SMARTCARD Output CLK /10 */
  HAL_SMARTCARD_SCLK_PRESC_DIV10       = LL_USART_SMARTCARD_PRESCALER_DIV10,
  /*!< SMARTCARD Output CLK /12 */
  HAL_SMARTCARD_SCLK_PRESC_DIV12       = LL_USART_SMARTCARD_PRESCALER_DIV12,
  /*!< SMARTCARD Output CLK /14 */
  HAL_SMARTCARD_SCLK_PRESC_DIV14       = LL_USART_SMARTCARD_PRESCALER_DIV14,
  /*!< SMARTCARD Output CLK /16 */
  HAL_SMARTCARD_SCLK_PRESC_DIV16       = LL_USART_SMARTCARD_PRESCALER_DIV16,
  /*!< SMARTCARD Output CLK /18 */
  HAL_SMARTCARD_SCLK_PRESC_DIV18       = LL_USART_SMARTCARD_PRESCALER_DIV18,
  /*!< SMARTCARD Output CLK /20 */
  HAL_SMARTCARD_SCLK_PRESC_DIV20       = LL_USART_SMARTCARD_PRESCALER_DIV20,
  /*!< SMARTCARD Output CLK /22 */
  HAL_SMARTCARD_SCLK_PRESC_DIV22       = LL_USART_SMARTCARD_PRESCALER_DIV22,
  /*!< SMARTCARD Output CLK /24 */
  HAL_SMARTCARD_SCLK_PRESC_DIV24       = LL_USART_SMARTCARD_PRESCALER_DIV24,
  /*!< SMARTCARD Output CLK /26 */
  HAL_SMARTCARD_SCLK_PRESC_DIV26       = LL_USART_SMARTCARD_PRESCALER_DIV26,
  /*!< SMARTCARD Output CLK /28 */
  HAL_SMARTCARD_SCLK_PRESC_DIV28       = LL_USART_SMARTCARD_PRESCALER_DIV28,
  /*!< SMARTCARD Output CLK /30 */
  HAL_SMARTCARD_SCLK_PRESC_DIV30       = LL_USART_SMARTCARD_PRESCALER_DIV30,
  /*!< SMARTCARD Output CLK /32 */
  HAL_SMARTCARD_SCLK_PRESC_DIV32       = LL_USART_SMARTCARD_PRESCALER_DIV32,
  /*!< SMARTCARD Output CLK /34 */
  HAL_SMARTCARD_SCLK_PRESC_DIV34       = LL_USART_SMARTCARD_PRESCALER_DIV34,
  /*!< SMARTCARD Output CLK /36 */
  HAL_SMARTCARD_SCLK_PRESC_DIV36       = LL_USART_SMARTCARD_PRESCALER_DIV36,
  /*!< SMARTCARD Output CLK /38 */
  HAL_SMARTCARD_SCLK_PRESC_DIV38       = LL_USART_SMARTCARD_PRESCALER_DIV38,
  /*!< SMARTCARD Output CLK /40 */
  HAL_SMARTCARD_SCLK_PRESC_DIV40       = LL_USART_SMARTCARD_PRESCALER_DIV40,
  /*!< SMARTCARD Output CLK /42 */
  HAL_SMARTCARD_SCLK_PRESC_DIV42       = LL_USART_SMARTCARD_PRESCALER_DIV42,
  /*!< SMARTCARD Output CLK /44 */
  HAL_SMARTCARD_SCLK_PRESC_DIV44       = LL_USART_SMARTCARD_PRESCALER_DIV44,
  /*!< SMARTCARD Output CLK /46 */
  HAL_SMARTCARD_SCLK_PRESC_DIV46       = LL_USART_SMARTCARD_PRESCALER_DIV46,
  /*!< SMARTCARD Output CLK /48 */
  HAL_SMARTCARD_SCLK_PRESC_DIV48       = LL_USART_SMARTCARD_PRESCALER_DIV48,
  /*!< SMARTCARD Output CLK /50 */
  HAL_SMARTCARD_SCLK_PRESC_DIV50       = LL_USART_SMARTCARD_PRESCALER_DIV50,
  /*!< SMARTCARD Output CLK /52 */
  HAL_SMARTCARD_SCLK_PRESC_DIV52       = LL_USART_SMARTCARD_PRESCALER_DIV52,
  /*!< SMARTCARD Output CLK /54 */
  HAL_SMARTCARD_SCLK_PRESC_DIV54       = LL_USART_SMARTCARD_PRESCALER_DIV54,
  /*!< SMARTCARD Output CLK /56 */
  HAL_SMARTCARD_SCLK_PRESC_DIV56       = LL_USART_SMARTCARD_PRESCALER_DIV56,
  /*!< SMARTCARD Output CLK /58 */
  HAL_SMARTCARD_SCLK_PRESC_DIV58       = LL_USART_SMARTCARD_PRESCALER_DIV58,
  /*!< SMARTCARD Output CLK /60 */
  HAL_SMARTCARD_SCLK_PRESC_DIV60       = LL_USART_SMARTCARD_PRESCALER_DIV60,
  /*!< SMARTCARD Output CLK /62 */
  HAL_SMARTCARD_SCLK_PRESC_DIV62       = LL_USART_SMARTCARD_PRESCALER_DIV62
} hal_smartcard_source_clock_prescaler_t;

/**
  * @brief HAL SMARTCARD Clock Output enum definition.
  */
typedef enum
{
  /*!< Clock signal output on CK pin disabled */
  HAL_SMARTCARD_CLOCK_OUTPUT_DISABLE     = LL_USART_CLOCK_OUTPUT_DISABLED,
  /*!< Clock signal output on CK pin enabled  */
  HAL_SMARTCARD_CLOCK_OUTPUT_ENABLE      = LL_USART_CLOCK_OUTPUT_ENABLED
} hal_smartcard_clock_output_t;

/**
  * @brief HAL SMARTCARD Clock polarity enum definition.
  */
typedef enum
{
  /*!< Polarity Low */
  HAL_SMARTCARD_CLOCK_POLARITY_LOW       = LL_USART_CLOCK_POLARITY_LOW,
  /*!< Polarity High */
  HAL_SMARTCARD_CLOCK_POLARITY_HIGH      = LL_USART_CLOCK_POLARITY_HIGH
} hal_smartcard_clock_polarity_t;

/**
  * @brief HAL SMARTCARD Clock phase enum definition.
  */
typedef enum
{
  /*!< The first clock transition is the first data capture edge */
  HAL_SMARTCARD_CLOCK_PHASE_1_EDGE        = LL_USART_CLOCK_PHASE_1_EDGE,
  /*!< The second clock transition is the first data capture edge */
  HAL_SMARTCARD_CLOCK_PHASE_2_EDGE        = LL_USART_CLOCK_PHASE_2_EDGE
} hal_smartcard_clock_phase_t;

/**
  * @brief HAL SMARTCARD Timeout status definition.
  */
typedef enum
{
  /*!< Timeout disabled */
  HAL_SMARTCARD_TIMEOUT_DISABLED       = 0U,
  /*!< Timeout enabled */
  HAL_SMARTCARD_TIMEOUT_ENABLED        = 1U
} hal_smartcard_timeout_status_t;

/**
  * @brief HAL SMARTCARD Pre guard time Tx complete indication enum definition.
  */
typedef enum
{
  /*!< SMARTCARD transmission complete (flag raised when guard time has elapsed) */
  HAL_SMARTCARD_TX_CPLT_AFTER_GUARD_TIME   = 0U,
  /*!< SMARTCARD transmission complete before guard time */
  HAL_SMARTCARD_TX_CPLT_BEFORE_GUARD_TIME  = 1U

} hal_smartcard_tx_cplt_guard_time_indication_t ;

/**
  * @brief HAL SMARTCARD End of block interrupt status definition.
  */
typedef enum
{
  /*!< End of block interrupt disabled */
  HAL_SMARTCARD_EOB_IT_DISABLED       = 0U,
  /*!< End of block interrupt enabled */
  HAL_SMARTCARD_EOB_IT_ENABLED        = 1U
} hal_smartcard_end_of_block_interrupt_status_t;

