MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.h
#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)

/**
  * @brief HAL SMARTCARD Fifo status definition.
  */
typedef enum
{
  /*!< Fifo disabled */
  HAL_SMARTCARD_FIFO_MODE_DISABLED          = 0U,
  /*!< Fifo enabled */
  HAL_SMARTCARD_FIFO_MODE_ENABLED           = 1U
} hal_smartcard_fifo_mode_status_t;

/**
  * @brief HAL SMARTCARD Fifo threshold enum definition.
  */
typedef enum
{
  /*!< FIFO reaches 1/8 of its depth */
  HAL_SMARTCARD_FIFO_THRESHOLD_1_8     = LL_USART_FIFO_THRESHOLD_1_8,
  /*!< FIFO reaches 1/4 of its depth */
  HAL_SMARTCARD_FIFO_THRESHOLD_1_4     = LL_USART_FIFO_THRESHOLD_1_4,
  /*!< FIFO reaches 1/2 of its depth */
  HAL_SMARTCARD_FIFO_THRESHOLD_1_2     = LL_USART_FIFO_THRESHOLD_1_2,
  /*!< FIFO reaches 3/4 of its depth */
  HAL_SMARTCARD_FIFO_THRESHOLD_3_4     = LL_USART_FIFO_THRESHOLD_3_4,
  /*!< FIFO reaches 7/8 of its depth */
  HAL_SMARTCARD_FIFO_THRESHOLD_7_8     = LL_USART_FIFO_THRESHOLD_7_8,
  /*!< FIFO reaches 8/8 of its depth */
  HAL_SMARTCARD_FIFO_THRESHOLD_8_8     = LL_USART_FIFO_THRESHOLD_8_8
} hal_smartcard_fifo_threshold_t;
#endif /* USE_HAL_SMARTCARD_FIFO */

/*! HAL SMARTCARD handler type */
typedef struct hal_smartcard_handle_s hal_smartcard_handle_t;

#if defined(USE_HAL_SMARTCARD_REGISTER_CALLBACKS) && (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
/*! HAL SMARTCARD Generic SMARTCARD callback Type */
typedef void (* hal_smartcard_cb_t)(hal_smartcard_handle_t *hsmartcard);
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */

/**
  * @brief HAL SMARTCARD handle structure type.
  */
struct hal_smartcard_handle_s
{
  /*! Peripheral instance        */
  hal_smartcard_t instance;

  /*! SMARTCARD state information related to global handle management */
  volatile hal_smartcard_state_t global_state;

  /*! Pointer to SMARTCARD Tx transfer buffer */
  const uint8_t *p_tx_buff;

  /*! SMARTCARD Tx Transfer size              */
  volatile uint32_t tx_xfer_size;

  /*! SMARTCARD Tx Transfer Counter           */
  volatile uint32_t tx_xfer_count;

  /*! Pointer to SMARTCARD Rx transfer buffer */
  uint8_t *p_rx_buff;

  /*! SMARTCARD Rx Transfer size              */
  volatile uint32_t rx_xfer_size;

  /*! SMARTCARD Rx Transfer Counter           */
  volatile uint32_t rx_xfer_count;

#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
  /*! Specifies whether the FIFO mode is used */
  hal_smartcard_fifo_mode_status_t fifo_status;

  /*! Number of data to process during RX ISR execution */
  uint16_t nb_rx_data_to_process;

  /*! Number of data to process during TX ISR execution */
  uint16_t nb_tx_data_to_process;

#endif /* USE_HAL_SMARTCARD_FIFO */
  /*! Tx complete indication configuration: before guard time or after */
  hal_smartcard_tx_cplt_guard_time_indication_t   tx_cplt_indication;

  /*! Function pointer to Rx IRQ handler */
  void (*p_rx_isr)(struct hal_smartcard_handle_s *hsmartcard);

  /*! Function pointer to Tx IRQ handler */
  void (*p_tx_isr)(struct hal_smartcard_handle_s *hsmartcard);

#if defined (USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
  /*! SMARTCARD Tx DMA handle parameters      */
  hal_dma_handle_t *hdma_tx;

  /*! SMARTCARD Rx DMA handle parameters      */
  hal_dma_handle_t *hdma_rx;

#endif /* USE_HAL_SMARTCARD_DMA */
#if defined(USE_HAL_SMARTCARD_REGISTER_CALLBACKS) && (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)
  /*! SMARTCARD Tx complete callback             */
  hal_smartcard_cb_t p_tx_cplt_callback;

  /*! SMARTCARD Tx Half complete callback        */
  hal_smartcard_cb_t p_tx_half_cplt_callback;

  /*! SMARTCARD Rx complete callback             */
  hal_smartcard_cb_t p_rx_cplt_callback;

  /*! SMARTCARD Rx Half complete callback        */
  hal_smartcard_cb_t p_rx_half_cplt_callback;

  /*! SMARTCARD Error callback                   */
  hal_smartcard_cb_t p_error_callback;

  /*! SMARTCARD Abort complete callback          */
  hal_smartcard_cb_t p_abort_cplt_callback;

#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
  /*! SMARTCARD Rx FIFO full callback            */
  hal_smartcard_cb_t p_rx_fifo_full_callback;

  /*! SMARTCARD Tx FIFO empty callback           */
  hal_smartcard_cb_t p_tx_fifo_empty_callback;

#endif /* USE_HAL_SMARTCARD_FIFO */
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */
#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  /*! USART OS semaphore */
  hal_os_semaphore_t semaphore;

#endif /* USE_HAL_MUTEX */
#if defined (USE_HAL_SMARTCARD_USER_DATA) && (USE_HAL_SMARTCARD_USER_DATA == 1)
  /*! User data pointer */
  const void *p_user_data;

#endif /* USE_HAL_SMARTCARD_USER_DATA */
#if defined(USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
  /*! Last error codes */
  volatile uint32_t last_error_codes;
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */
};

/**
  * @brief HAL SMARTCARD Global configuration structure definition.
  */
typedef struct
{
  uint32_t                           baud_rate;            /*!< Configures the SMARTCARD communication baud rate. The
                                                                baud rate register is computed using the following
                                                                formula:
                                                                baud rate register = usart_ker_ckpres / baud_rate
                                                                where usart_ker_ckpres is the USART input clock divided
                                                                by a prescaler. */

  hal_smartcard_stop_bits_t          stop_bits;            /*!< Specifies the number of stop bits. */

  hal_smartcard_bit_order_t          first_bit;            /*!< Specifies whether MSB is sent first on the USART line. */

  hal_smartcard_parity_t             parity;               /*!< Specifies the parity mode. The parity is enabled by
                                                                default (PCE is forced to 1). Since the WordLength is
                                                                forced to 8 bits + parity, M is forced to 1 and the
                                                                parity bit is the 9th bit. */

