MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.h
  hal_smartcard_nack_state_t         nack;                 /*!< Specifies whether the SMARTCARD NACK transmission
                                                                is enabled in case of parity error. */

  hal_smartcard_prescaler_t          clock_prescaler;      /*!< Specifies the prescaler value used to divide the USART
                                                                input clock to provide USART clock source. */

  hal_smartcard_source_clock_prescaler_t     sclk_prescaler; /*!< Specifies the SMARTCARD prescaler used to divide the
                                                                USART clock, the clock sent to the smartcard is the
                                                                output clock after the division. */

  hal_smartcard_clock_output_t       clock_output;         /*!< Specifies whether the CLK signal is output or not. */

  hal_smartcard_clock_polarity_t     clock_polarity;       /*!< Specifies the steady state of the serial clock. */

  hal_smartcard_clock_phase_t        clock_phase;          /*!< Specifies the clock transition on which the bit capture
                                                                is made. */

  uint32_t                           guard_time_etu;       /*!< Specifies the SMARTCARD guard time ETU
                                                                (Elementary Time Unit) applied after stop bits. */

  uint32_t                           auto_retry_count;     /*!< Specifies the SMARTCARD auto-retry count (number of
                                                                retries in receive and transmit mode). When set to 0,
                                                                retransmission is disabled. Otherwise, its maximum value
                                                                is 7 (before signalling an error). */
} hal_smartcard_config_t;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup SMARTCARD_Exported_Constants HAL SMARTCARD Constants
  * @{
  */

/** @defgroup SMARTCARD_Error_Code SMARTCARD Error Codes
  * @{
  */
/*! No error */
#define HAL_SMARTCARD_ERROR_NONE     (0UL)

/*! Parity error on RX */
#define HAL_SMARTCARD_RECEIVE_ERROR_PE       (0x1UL << 0)

/*! Noise error on RX */
#define HAL_SMARTCARD_RECEIVE_ERROR_NE       (0x1UL << 1U)

/*! Frame error on RX */
#define HAL_SMARTCARD_RECEIVE_ERROR_FE       (0x1UL << 2U)

/*! Overrun error on RX */
#define HAL_SMARTCARD_RECEIVE_ERROR_ORE      (0x1UL << 3U)

#if defined (USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1U)
/*! DMA transfer error on RX */
#define HAL_SMARTCARD_RECEIVE_ERROR_DMA      (0x1UL << 4U)

#endif /* USE_HAL_SMARTCARD_DMA */
/*! Receiver timeout error on RX */
#define HAL_SMARTCARD_RECEIVE_ERROR_RTO      (0x1UL << 5U)

/*! No ACK after transmit despite trials */
#define HAL_SMARTCARD_TRANSMIT_ERROR_NACK    (0x1UL << 6U)

#if defined (USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1U)
/*! DMA transfer error on TX */
#define HAL_SMARTCARD_TRANSMIT_ERROR_DMA     (0x1UL << 16U)
#endif /* USE_HAL_SMARTCARD_DMA */
/**
  * @}
  */

/** @defgroup SMARTCARD_Optional_Interrupts SMARTCARD Optional interrupts
  * @{
  */

/** @defgroup SMARTCARD_Transmit_IT_Optional_Interrupts SMARTCARD optional TX IT interrupts
  * @{
  */
/*! All optional interrupts are disabled */
#define HAL_SMARTCARD_OPT_TX_IT_NONE           0U
#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
/*! Enable optional FIFO EMPTY IT for TX_IT_Opt */
#define HAL_SMARTCARD_OPT_TX_IT_FIFO_EMPTY     (1UL << 30U)
/*! Activate default optional IT for transmit IT based process */
#define HAL_SMARTCARD_OPT_TX_IT_DEFAULT        (HAL_SMARTCARD_OPT_TX_IT_FIFO_EMPTY)
#endif /* USE_HAL_SMARTCARD_FIFO */
/**
  * @}
  */
#if defined(USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
/** @defgroup SMARTCARD_Transmit_DMA_Optional_Interrupts SMARTCARD Optional TX DMA interrupts
  * @{
  */
/*! All optional interrupts are disabled */
#define HAL_SMARTCARD_OPT_DMA_TX_IT_NONE          0U
/*! Enable optional HT IT for TX_DMA_Opt */
#define HAL_SMARTCARD_OPT_DMA_TX_IT_HT            (HAL_DMA_OPT_IT_HT)
/*! Enable all optional IT for TX_DMA_Opt */
#define HAL_SMARTCARD_OPT_DMA_TX_IT_DEFAULT       (HAL_SMARTCARD_OPT_DMA_TX_IT_HT)
/**
  * @}
  */
#endif /* USE_HAL_SMARTCARD_DMA */

/** @defgroup SMARTCARD_Receive_IT_Optional_Interrupts SMARTCARD Optional RX IT interrupts
  * @{
  */
/*! All optional interrupts are disabled */
#define HAL_SMARTCARD_OPT_RX_IT_NONE           0U
#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
/*! Enable optional FIFO FULL IT for RX_IT_Opt */
#define HAL_SMARTCARD_OPT_RX_IT_FIFO_FULL      (1UL << 25U)
/*! Activate default optional IT for receive IT-based process */
#define HAL_SMARTCARD_OPT_RX_IT_DEFAULT        (HAL_SMARTCARD_OPT_RX_IT_FIFO_FULL)
#endif /* USE_HAL_SMARTCARD_FIFO */
/**
  * @}
  */

#if defined(USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
/** @defgroup SMARTCARD_Receive_DMA_Optional_Interrupts SMARTCARD Optional RX DMA interrupts
  * @{
  */
#define HAL_SMARTCARD_OPT_DMA_RX_IT_NONE         0U                      /*!< All optional interrupts are disabled */
#define HAL_SMARTCARD_OPT_DMA_RX_IT_HT           (HAL_DMA_OPT_IT_HT)     /*!< Enable optional HT IT for RX_DMA_Opt */
#define HAL_SMARTCARD_OPT_DMA_RX_IT_DEFAULT      (HAL_SMARTCARD_OPT_DMA_RX_IT_HT)
/*!< Enable all optional IT for RX_DMA_Opt */
/**
  * @}
  */
#endif /* USE_HAL_SMARTCARD_DMA */

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup SMARTCARD_Exported_Functions HAL SMARTCARD Functions
  * @{
  */

/* Initialization and de-initialization functions *****************************/
/** @defgroup SMARTCARD_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  */

hal_status_t HAL_SMARTCARD_Init(hal_smartcard_handle_t *hsmartcard, hal_smartcard_t instance);
hal_status_t HAL_SMARTCARD_DeInit(hal_smartcard_handle_t *hsmartcard);

/**
  * @}
  */

/* IO operation functions *****************************************************/
/** @defgroup SMARTCARD_Exported_Functions_Group2 General Config functions
  * @{
  */

hal_status_t HAL_SMARTCARD_SetConfig(hal_smartcard_handle_t *hsmartcard, const hal_smartcard_config_t *p_config);
hal_status_t HAL_SMARTCARD_GetConfig(const hal_smartcard_handle_t *hsmartcard, hal_smartcard_config_t *p_config);

/**
  * @}
  */

/** @defgroup SMARTCARD_Exported_Functions_Group3 Unitary basic config functions
  * @{
  */

hal_status_t HAL_SMARTCARD_SetBaudRate(const hal_smartcard_handle_t *hsmartcard, uint32_t baud_rate);
uint32_t HAL_SMARTCARD_GetBaudRate(const hal_smartcard_handle_t *hsmartcard);

hal_status_t HAL_SMARTCARD_SetStopBits(const hal_smartcard_handle_t *hsmartcard,
                                       hal_smartcard_stop_bits_t stop_bits);
hal_smartcard_stop_bits_t HAL_SMARTCARD_GetStopBits(const hal_smartcard_handle_t *hsmartcard);

hal_status_t HAL_SMARTCARD_SetFirstBit(const hal_smartcard_handle_t *hsmartcard,
                                       hal_smartcard_bit_order_t first_bit);
hal_smartcard_bit_order_t HAL_SMARTCARD_GetFirstBit(const hal_smartcard_handle_t *hsmartcard);

hal_status_t HAL_SMARTCARD_SetParity(const hal_smartcard_handle_t *hsmartcard, hal_smartcard_parity_t parity);
hal_smartcard_parity_t HAL_SMARTCARD_GetParity(const hal_smartcard_handle_t *hsmartcard);

hal_status_t HAL_SMARTCARD_SetNack(const hal_smartcard_handle_t *hsmartcard, hal_smartcard_nack_state_t nack);
hal_smartcard_nack_state_t HAL_SMARTCARD_GetNack(const hal_smartcard_handle_t *hsmartcard);

hal_status_t HAL_SMARTCARD_SetClockOutput(const hal_smartcard_handle_t *hsmartcard,
                                          hal_smartcard_clock_output_t clock_output);
hal_smartcard_clock_output_t HAL_SMARTCARD_GetClockOutput(const hal_smartcard_handle_t *hsmartcard);

hal_status_t HAL_SMARTCARD_SetClockPolarity(const hal_smartcard_handle_t *hsmartcard,
                                            hal_smartcard_clock_polarity_t clock_polarity);
hal_smartcard_clock_polarity_t HAL_SMARTCARD_GetClockPolarity(const hal_smartcard_handle_t *hsmartcard);

hal_status_t HAL_SMARTCARD_SetClockPhase(const hal_smartcard_handle_t *hsmartcard,
                                         hal_smartcard_clock_phase_t clock_phase);
hal_smartcard_clock_phase_t HAL_SMARTCARD_GetClockPhase(const hal_smartcard_handle_t *hsmartcard);

hal_status_t HAL_SMARTCARD_SetGuardTime(const hal_smartcard_handle_t *hsmartcard, uint32_t guard_time_etu);
uint32_t HAL_SMARTCARD_GetGuardTime(const hal_smartcard_handle_t *hsmartcard);

hal_status_t HAL_SMARTCARD_SetAutoRetryCount(const hal_smartcard_handle_t *hsmartcard, uint32_t retry_count);
uint32_t HAL_SMARTCARD_GetAutoRetryCount(const hal_smartcard_handle_t *hsmartcard);

/**
  * @}
  */

/** @defgroup SMARTCARD_Exported_Functions_Group4 Advanced config functions
  * @{
  */

hal_status_t HAL_SMARTCARD_EnableIOInvert(const hal_smartcard_handle_t *hsmartcard);
hal_status_t HAL_SMARTCARD_DisableIOInvert(const hal_smartcard_handle_t *hsmartcard);
hal_smartcard_io_invert_status_t HAL_SMARTCARD_IsEnabledIOInvert(const hal_smartcard_handle_t *hsmartcard);

hal_status_t HAL_SMARTCARD_EnableDataInvert(const hal_smartcard_handle_t *hsmartcard);
hal_status_t HAL_SMARTCARD_DisableDataInvert(const hal_smartcard_handle_t *hsmartcard);
hal_smartcard_data_invert_status_t HAL_SMARTCARD_IsEnabledDataInvert(const hal_smartcard_handle_t *hsmartcard);

hal_status_t HAL_SMARTCARD_EnableTxRxSwap(const hal_smartcard_handle_t *hsmartcard);
hal_status_t HAL_SMARTCARD_DisableTxRxSwap(const hal_smartcard_handle_t *hsmartcard);
hal_smartcard_tx_rx_swap_status_t HAL_SMARTCARD_IsEnabledTxRxSwap(const hal_smartcard_handle_t *hsmartcard);

