MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.h
hal_status_t HAL_SMARTCARD_EnableRxOverRunDetection(const hal_smartcard_handle_t *hsmartcard);
hal_status_t HAL_SMARTCARD_DisableRxOverRunDetection(const hal_smartcard_handle_t *hsmartcard);
hal_smartcard_rx_overrun_detection_status_t HAL_SMARTCARD_IsEnabledRxOverRunDetection(
  const hal_smartcard_handle_t *hsmartcard);

hal_status_t HAL_SMARTCARD_EnableDMAStopOnRxError(const hal_smartcard_handle_t *hsmartcard);
hal_status_t HAL_SMARTCARD_DisableDMAStopOnRxError(const hal_smartcard_handle_t *hsmartcard);
hal_smartcard_dma_stop_status_t HAL_SMARTCARD_IsEnabledDMAStopOnRxError(const hal_smartcard_handle_t *hsmartcard);

hal_status_t HAL_SMARTCARD_SetReceiverTimeout(const hal_smartcard_handle_t *hsmartcard, uint32_t timeout_etu);
uint32_t HAL_SMARTCARD_GetReceiverTimeout(const hal_smartcard_handle_t *hsmartcard);

hal_status_t HAL_SMARTCARD_EnableReceiverTimeout(const hal_smartcard_handle_t *hsmartcard);
hal_status_t HAL_SMARTCARD_DisableReceiverTimeout(const hal_smartcard_handle_t *hsmartcard);
hal_smartcard_timeout_status_t HAL_SMARTCARD_IsEnabledReceiverTimeout(const hal_smartcard_handle_t *hsmartcard);

hal_status_t HAL_SMARTCARD_SetTxCpltIndication(hal_smartcard_handle_t *hsmartcard,
                                               const hal_smartcard_tx_cplt_guard_time_indication_t  tx_cplt_indication);
hal_smartcard_tx_cplt_guard_time_indication_t HAL_SMARTCARD_GetTxCpltIndication(const hal_smartcard_handle_t
                                                                                *hsmartcard);

hal_status_t HAL_SMARTCARD_SetBlockLength(const hal_smartcard_handle_t *hsmartcard, uint32_t block_length_byte);
uint32_t HAL_SMARTCARD_GetBlockLength(const hal_smartcard_handle_t *hsmartcard);
hal_status_t HAL_SMARTCARD_EnableEndOfBlockIT(const hal_smartcard_handle_t *hsmartcard);
hal_status_t HAL_SMARTCARD_DisableEndOfBlockIT(const hal_smartcard_handle_t *hsmartcard);
hal_smartcard_end_of_block_interrupt_status_t HAL_SMARTCARD_IsEnabledEndOfBlockIT(const hal_smartcard_handle_t
    *hsmartcard);

/**
  * @}
  */

/** @defgroup SMARTCARD_Exported_Functions_Group5 FIFO config functions
  * @{
  */
#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
hal_status_t HAL_SMARTCARD_EnableFifoMode(hal_smartcard_handle_t *hsmartcard);
hal_status_t HAL_SMARTCARD_DisableFifoMode(hal_smartcard_handle_t *hsmartcard);
hal_smartcard_fifo_mode_status_t HAL_SMARTCARD_IsEnabledFifoMode(const hal_smartcard_handle_t *hsmartcard);
hal_status_t HAL_SMARTCARD_SetTxFifoThreshold(hal_smartcard_handle_t *hsmartcard,
                                              const hal_smartcard_fifo_threshold_t tx_fifo_threshold);
hal_smartcard_fifo_threshold_t HAL_SMARTCARD_GetTxFifoThreshold(const hal_smartcard_handle_t *hsmartcard);
hal_status_t HAL_SMARTCARD_SetRxFifoThreshold(hal_smartcard_handle_t *hsmartcard,
                                              const hal_smartcard_fifo_threshold_t rx_fifo_threshold);
hal_smartcard_fifo_threshold_t HAL_SMARTCARD_GetRxFifoThreshold(const hal_smartcard_handle_t *hsmartcard);
#endif /* USE_HAL_SMARTCARD_FIFO */
/**
  * @}
  */

/** @defgroup SMARTCARD_Exported_Functions_Group6 IO operation functions
  * @{
  */
hal_status_t HAL_SMARTCARD_Transmit(hal_smartcard_handle_t *hsmartcard, const uint8_t *p_data, uint16_t size_byte,
                                    uint32_t timeout_ms);
hal_status_t HAL_SMARTCARD_Receive(hal_smartcard_handle_t *hsmartcard, uint8_t *p_data, uint16_t size_byte,
                                   uint32_t timeout_ms);
hal_status_t HAL_SMARTCARD_Transmit_IT(hal_smartcard_handle_t *hsmartcard, const uint8_t *p_data, uint16_t size_byte);
hal_status_t HAL_SMARTCARD_Receive_IT(hal_smartcard_handle_t *hsmartcard, uint8_t *p_data, uint16_t size_byte);
#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
hal_status_t HAL_SMARTCARD_Transmit_IT_Opt(hal_smartcard_handle_t *hsmartcard, const uint8_t *p_data,
                                           uint16_t size_byte, uint32_t interrupts);
hal_status_t HAL_SMARTCARD_Receive_IT_Opt(hal_smartcard_handle_t *hsmartcard, uint8_t *p_data,
                                          uint16_t size_byte, uint32_t interrupts);
#endif /* USE_HAL_SMARTCARD_FIFO */
#if defined(USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
hal_status_t HAL_SMARTCARD_Transmit_DMA(hal_smartcard_handle_t *hsmartcard, const uint8_t *p_data, uint16_t size_byte);
hal_status_t HAL_SMARTCARD_Receive_DMA(hal_smartcard_handle_t *hsmartcard, uint8_t *p_data, uint16_t size_byte);
hal_status_t HAL_SMARTCARD_Transmit_DMA_Opt(hal_smartcard_handle_t *hsmartcard, const uint8_t *p_data,
                                            uint16_t size_byte, uint32_t interrupts);
hal_status_t HAL_SMARTCARD_Receive_DMA_Opt(hal_smartcard_handle_t *hsmartcard, uint8_t *p_data,
                                           uint16_t size_byte, uint32_t interrupts);
#endif /* USE_HAL_SMARTCARD_DMA */
/* Transfer Abort functions */
hal_status_t HAL_SMARTCARD_Abort(hal_smartcard_handle_t *hsmartcard);
hal_status_t HAL_SMARTCARD_Abort_IT(hal_smartcard_handle_t *hsmartcard);

/**
  * @}
  */

/** @defgroup SMARTCARD_Exported_Functions_Group7 DMA Configuration functions
  * @{
  */
#if defined (USE_HAL_SMARTCARD_DMA) && (USE_HAL_SMARTCARD_DMA == 1)
hal_status_t HAL_SMARTCARD_SetTxDMA(hal_smartcard_handle_t *hsmartcard, hal_dma_handle_t *hdma_tx);
hal_status_t HAL_SMARTCARD_SetRxDMA(hal_smartcard_handle_t *hsmartcard, hal_dma_handle_t *hdma_rx);
#endif /* USE_HAL_SMARTCARD_DMA */

/**
  * @}
  */

/** @defgroup SMARTCARD_Exported_Functions_Group8 IRQHandler and Default Callbacks
  * @{
  */
void HAL_SMARTCARD_IRQHandler(hal_smartcard_handle_t *hsmartcard);

/* Default callback */
void HAL_SMARTCARD_TxCpltCallback(hal_smartcard_handle_t *hsmartcard);
void HAL_SMARTCARD_TxHalfCpltCallback(hal_smartcard_handle_t *hsmartcard);
void HAL_SMARTCARD_RxCpltCallback(hal_smartcard_handle_t *hsmartcard);
void HAL_SMARTCARD_RxHalfCpltCallback(hal_smartcard_handle_t *hsmartcard);
void HAL_SMARTCARD_ErrorCallback(hal_smartcard_handle_t *hsmartcard);
void HAL_SMARTCARD_AbortCpltCallback(hal_smartcard_handle_t *hsmartcard);

