MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_smartcard.h
#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
void HAL_SMARTCARD_RxFifoFullCallback(hal_smartcard_handle_t *hsmartcard);
void HAL_SMARTCARD_TxFifoEmptyCallback(hal_smartcard_handle_t *hsmartcard);
#endif /* USE_HAL_SMARTCARD_FIFO */

/**
  * @}
  */

/** @defgroup SMARTCARD_Exported_Functions_Group9 Callbacks Register functions
  * @{
  */
#if (USE_HAL_SMARTCARD_REGISTER_CALLBACKS == 1)

hal_status_t HAL_SMARTCARD_RegisterTxCpltCallback(hal_smartcard_handle_t *hsmartcard, hal_smartcard_cb_t p_callback);
hal_status_t HAL_SMARTCARD_RegisterTxHalfCpltCallback(hal_smartcard_handle_t *hsmartcard,
                                                      hal_smartcard_cb_t p_callback);
hal_status_t HAL_SMARTCARD_RegisterRxCpltCallback(hal_smartcard_handle_t *hsmartcard, hal_smartcard_cb_t p_callback);
hal_status_t HAL_SMARTCARD_RegisterRxHalfCpltCallback(hal_smartcard_handle_t *hsmartcard,
                                                      hal_smartcard_cb_t p_callback);
hal_status_t HAL_SMARTCARD_RegisterErrorCallback(hal_smartcard_handle_t *hsmartcard, hal_smartcard_cb_t p_callback);
hal_status_t HAL_SMARTCARD_RegisterAbortCpltCallback(hal_smartcard_handle_t *hsmartcard,
                                                     hal_smartcard_cb_t p_callback);

#if defined(USE_HAL_SMARTCARD_FIFO) && (USE_HAL_SMARTCARD_FIFO == 1)
hal_status_t HAL_SMARTCARD_RegisterRxFifoFullCallback(hal_smartcard_handle_t *hsmartcard,
                                                      hal_smartcard_cb_t p_callback);
hal_status_t HAL_SMARTCARD_RegisterTxFifoEmptyCallback(hal_smartcard_handle_t *hsmartcard,
                                                       hal_smartcard_cb_t p_callback);
#endif /* USE_HAL_SMARTCARD_FIFO */
#endif /* USE_HAL_SMARTCARD_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Peripheral State and Error functions ***************************************/
/** @defgroup SMARTCARD_Exported_Functions_Group10 State, Error and Clock Frequency functions
  * @{
  */

hal_smartcard_state_t HAL_SMARTCARD_GetState(const hal_smartcard_handle_t *hsmartcard);
#if defined(USE_HAL_SMARTCARD_GET_LAST_ERRORS) && (USE_HAL_SMARTCARD_GET_LAST_ERRORS == 1)
uint32_t              HAL_SMARTCARD_GetLastErrorCodes(const hal_smartcard_handle_t *hsmartcard);
#endif /* USE_HAL_SMARTCARD_GET_LAST_ERRORS */
uint32_t              HAL_SMARTCARD_GetClockFreq(const hal_smartcard_handle_t *hsmartcard);

/**
  * @}
  */
#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)

/** @defgroup SMARTCARD_Exported_Functions_Group11 Acquire/Release Bus functions
  * @{
  */

hal_status_t HAL_SMARTCARD_AcquireBus(hal_smartcard_handle_t *hsmartcard, uint32_t timeout_ms);
hal_status_t HAL_SMARTCARD_ReleaseBus(hal_smartcard_handle_t *hsmartcard);

/**
  * @}
  */

#endif /*USE_HAL_MUTEX */

#if defined(USE_HAL_SMARTCARD_USER_DATA) && (USE_HAL_SMARTCARD_USER_DATA == 1)
/** @defgroup SMARTCARD_Exported_Functions_Group12 UserData functions
  * @{
  */

void HAL_SMARTCARD_SetUserData(hal_smartcard_handle_t *hsmartcard, const void *p_user_data);
const void *HAL_SMARTCARD_GetUserData(const hal_smartcard_handle_t *hsmartcard);

/**
  * @}
  */

#endif /* USE_HAL_SMARTCARD_USER_DATA */

/**
  * @}
  */

/**
  * @}
  */
#endif /* USART1 || USART2 || USART3 || UART4 || UART5 || USART6 || UART7 */
/**
  * @}
  */
#ifdef __cplusplus
}
#endif /* __cplusplus */
#endif /* STM32C5XX_HAL_SMARTCARD_H */
